<!DOCTYPE html>
<html lang="zh-Hans">
<head>

    <!--[if lt IE 9]>
        <style>body {display: none; background: none !important} </style>
        <meta http-equiv="Refresh" Content="0; url=//outdatedbrowser.com/" />
    <![endif]-->

<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge, chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<meta name="format-detection" content="telephone=no" />
<meta name="author" content="黄柳淞" />


    
    


<meta name="description" content="在这不算美好的时代,过着还算快乐的生活！">
<meta property="og:type" content="website">
<meta property="og:title" content="黄柳淞下问童子,言师码字去">
<meta property="og:url" content="http://www.huangliusong.top/index.html">
<meta property="og:site_name" content="黄柳淞下问童子,言师码字去">
<meta property="og:description" content="在这不算美好的时代,过着还算快乐的生活！">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="黄柳淞下问童子,言师码字去">
<meta name="twitter:description" content="在这不算美好的时代,过着还算快乐的生活！">

<link rel="apple-touch-icon" href= "/apple-touch-icon.png">


    <link rel="alternate" href="/atom.xml" title="黄柳淞下问童子,言师码字去" type="application/atom+xml">



    <link rel="shortcut icon" href="/favicon.png">



    <link href="//cdn.bootcss.com/animate.css/3.5.1/animate.min.css" rel="stylesheet">



    <link href="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.min.css" rel="stylesheet">



    <script src="//cdn.bootcss.com/pace/1.0.2/pace.min.js"></script>
    <link href="//cdn.bootcss.com/pace/1.0.2/themes/blue/pace-theme-minimal.css" rel="stylesheet">


<link rel="stylesheet" href="/css/style.css">


    <style> .article { opacity: 0;} </style>


<link href="//cdn.bootcss.com/font-awesome/4.6.3/css/font-awesome.min.css" rel="stylesheet">


<title>黄柳淞下问童子,言师码字去</title>

<script src="//cdn.bootcss.com/jquery/2.2.4/jquery.min.js"></script>
<script src="//cdn.bootcss.com/clipboard.js/1.5.10/clipboard.min.js"></script>

<script>
    var yiliaConfig = {
        fancybox: true,
        animate: true,
        isHome: true,
        isPost: false,
        isArchive: false,
        isTag: false,
        isCategory: false,
        fancybox_js: "//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.min.js",
        scrollreveal: "//cdn.bootcss.com/scrollReveal.js/3.1.4/scrollreveal.min.js",
        search: undefined
    }
</script>


    <script> yiliaConfig.jquery_ui = [false]; </script>



    <script> yiliaConfig.rootUrl = "\/";</script>






</head>
<body>
  <div id="container">
    <div class="left-col">
    <div class="overlay"></div>
<div class="intrude-less">
    <header id="header" class="inner">
        <a href="/" class="profilepic">
            <img src="/img/avatar.png" class="animated zoomIn">
        </a>
        <hgroup>
          <h1 class="header-author"><a href="/">黄柳淞</a></h1>
        </hgroup>

        
        <p class="header-subtitle">和我一起做个耐撕(nice)的人</p>
        

        


        
            <div id="switch-btn" class="switch-btn">
                <div class="icon">
                    <div class="icon-ctn">
                        <div class="icon-wrap icon-house" data-idx="0">
                            <div class="birdhouse"></div>
                            <div class="birdhouse_holes"></div>
                        </div>
                        <div class="icon-wrap icon-ribbon hide" data-idx="1">
                            <div class="ribbon"></div>
                        </div>
                        
                        <div class="icon-wrap icon-link hide" data-idx="2">
                            <div class="loopback_l"></div>
                            <div class="loopback_r"></div>
                        </div>
                        
                        
                        <div class="icon-wrap icon-me hide" data-idx="3">
                            <div class="user"></div>
                            <div class="shoulder"></div>
                        </div>
                        
                    </div>
                    
                </div>
                <div class="tips-box hide">
                    <div class="tips-arrow"></div>
                    <ul class="tips-inner">
                        <li>菜单</li>
                        <li>标签</li>
                        
                        <li>友情链接</li>
                        
                        
                        <li>关于我</li>
                        
                    </ul>
                </div>
            </div>
        

        <div id="switch-area" class="switch-area">
            <div class="switch-wrap">
                <section class="switch-part switch-part1">
                    <nav class="header-menu">
                        <ul>
                        
                            <li><a href="/">主页</a></li>
                        
                            <li><a href="/archives/">所有文章</a></li>
                        
                            <li><a href="/tags/">标签云</a></li>
                        
                            <li><a href="/about/">关于我</a></li>
                        
                        </ul>
                    </nav>
                    <nav class="header-nav">
                        <ul class="social">
                            
                                <a class="fa Email" href="/1138127608@qq.com" title="Email"></a>
                            
                                <a class="fa 新浪微博" href="http://weibo.com/5081932502/profile?rightmod=1&wvr=6&mod=personinfo&is_all=1" title="新浪微博"></a>
                            
                                <a class="fa GitHub" href="#" title="GitHub"></a>
                            
                                <a class="fa 知乎" href="https://www.zhihu.com/people/wei-lai-gong-cheng-shi" title="知乎"></a>
                            
                        </ul>
                    </nav>
                </section>
                
                
                <section class="switch-part switch-part2">
                    <div class="widget tagcloud" id="js-tagcloud">
                        <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/MyEclipse/">MyEclipse</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/java/">java</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/program/">program</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/图文/">图文</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/坚持/">坚持</a></li></ul>
                    </div>
                </section>
                
                
                
                <section class="switch-part switch-part3">
                    <div id="js-friends">
                    
                      <a class="main-nav-link switch-friends-link" href="http://www.huangliusong.top/">Hexo</a>
                    
                      <a class="main-nav-link switch-friends-link" href="https://pages.github.com/">GitHub</a>
                    
                      <a class="main-nav-link switch-friends-link" href="http://www.huangliusong.top/">hls-blog</a>
                    
                    </div>
                </section>
                

                
                
                <section class="switch-part switch-part4">
                
                    <div id="js-aboutme">专注于软件人文设计</div>
                </section>
                
            </div>
        </div>
    </header>                
</div>
    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
      <div class="overlay">
          <div class="slider-trigger"></div>
          <h1 class="header-author js-mobile-header hide"><a href="/" title="回到主页">黄柳淞</a></h1>
      </div>
    <div class="intrude-less">
        <header id="header" class="inner">
            <a href="/" class="profilepic">
                <img src="/img/avatar.png" class="animated zoomIn">
            </a>
            <hgroup>
              <h1 class="header-author"><a href="/" title="回到主页">黄柳淞</a></h1>
            </hgroup>
            
            <p class="header-subtitle">和我一起做个耐撕(nice)的人</p>
            
            <nav class="header-menu">
                <ul>
                
                    <li><a href="/">主页</a></li>
                
                    <li><a href="/archives/">所有文章</a></li>
                
                    <li><a href="/tags/">标签云</a></li>
                
                    <li><a href="/about/">关于我</a></li>
                
                <div class="clearfix"></div>
                </ul>
            </nav>
            <nav class="header-nav">
                        <ul class="social">
                            
                                <a class="fa Email" target="_blank" href="/1138127608@qq.com" title="Email"></a>
                            
                                <a class="fa 新浪微博" target="_blank" href="http://weibo.com/5081932502/profile?rightmod=1&wvr=6&mod=personinfo&is_all=1" title="新浪微博"></a>
                            
                                <a class="fa GitHub" target="_blank" href="#" title="GitHub"></a>
                            
                                <a class="fa 知乎" target="_blank" href="https://www.zhihu.com/people/wei-lai-gong-cheng-shi" title="知乎"></a>
                            
                        </ul>
            </nav>
        </header>                
    </div>
    <link class="menu-list" tags="标签" friends="友情链接" about="关于我"/>
</nav>
      <div class="body-wrap">
  
    <article id="post-hls-7" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/10/23/hls-7/" class="article-date">
      <time datetime="2016-10-23T01:06:04.000Z" itemprop="datePublished">2016-10-23</time>
</a>

 
    <a href="/2016/10/23/hls-7/#comments" title="查看评论">
        <i class="fa fa-comments-o" aria-hidden="true"></i>
        <span class="count-comment"></span>
        
            <span class="ds-thread-count"  data-thread-key="2016/10/23/hls-7/" ></span>
        
        
            <span class="disqus-comment-count" data-disqus-identifier="2016/10/23/hls-7/"></span>
        
    </a>

    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/23/hls-7/">如何将一件事长期坚持</a>
    </h1>
  

      </header>
      
    
    <div class="article-entry" itemprop="articleBody">
      
          
        <p>&#x8BC0;&#x7A8D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x5C31;&#x662F; &#x201C;&#x523B;&#x610F;&#x7EC3;&#x4E60;&#x201D;&#x3002;&#x201C;&#x523B;&#x610F;&#x7EC3;&#x4E60;&#x201D; &#x7684;&#x8981;&#x70B9;&#x6709;&#x4E94;&#x70B9;&#xFF1A;</p>
<ol>
<li><p>&#x8FC8;&#x51FA; &#x201C;&#x8212;&#x9002;&#x533A;&#x201D;&#xFF0C;&#x53EA;&#x5728; &#x201C;&#x5B66;&#x4E60;&#x533A;&#x201D; &#x5B66;&#x4E60;&#x3002;&#x4F46;&#x6CE8;&#x610F;&#x6B65;&#x5B50;&#x522B;&#x8FC8;&#x592A;&#x5927;&#xFF0C;&#x8FDB;&#x5165; &#x201C;&#x6050;&#x6016;&#x533A;&#x201D; &#x5C31;&#x626F;&#x5230;&#x86CB;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x628A;&#x8BAD;&#x7EC3;&#x7684;&#x5185;&#x5BB9;&#x5207;&#x5206;&#x6210;&#x4E00;&#x5C0F;&#x5757;&#x4E00;&#x5C0F;&#x5757;&#xFF0C;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x9488;&#x5BF9;&#x6027;&#x7EC3;&#x4E60;&#x3002;</p>
</li>
<li><p>&#x8FD9;&#x4E9B;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x5C0F;&#x5757;&#x7EC3;&#x4E60;&#xFF0C;&#x8981;&#x5927;&#x91CF;&#x91CD;&#x590D;&#x5730;&#x8FDB;&#x884C;&#x3002;</p>
</li>
<li><p>&#x7EC3;&#x4E60;&#x65F6;&#xFF0C;&#x968F;&#x65F6;&#x3001;&#x5373;&#x65F6;&#x83B7;&#x5F97;&#x6709;&#x6548;&#x7684;&#x53CD;&#x9988;&#x3002;</p>
</li>
<li><p>&#x7EC3;&#x4E60;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x9AD8;&#x5EA6;&#x96C6;&#x4E2D;&#x6CE8;&#x610F;&#x529B;&#x3002;</p>
</li>
</ol>
<p>&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x7B80;&#x5355;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x4E00;&#x80A1;&#x7ACB;&#x523B;&#x5728;&#x725B;&#x903C;&#x54C4;&#x54C4;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#x6492;&#x8DB3;&#x72C2;&#x5954;&#x7684;&#x51B2;&#x52A8;&#xFF1F;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E94;&#x4E2A;&#x8981;&#x70B9;&#x90FD;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x7740;&#x8BB8;&#x591A;&#x7684;&#x96BE;&#x70B9;&#x3002;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x5C31;&#x96C6;&#x4E2D;&#x5206;&#x6790;&#x7B2C;&#x4E09;&#x4E2A;&#x8981;&#x70B9;&#x6240;&#x9762;&#x4E34;&#x7684;&#x96BE;&#x70B9;&#xFF1A;</p>
<p>&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x6781;&#x5C11;&#x90E8;&#x5206;&#x4EBA;&#x6709;&#x610F;&#x5FD7;&#x529B;&#x80FD;&#x957F;&#x65F6;&#x95F4;&#x5927;&#x91CF;&#x91CD;&#x590D;&#x67AF;&#x71E5;&#x7684;&#x57FA;&#x7840;&#x7EC3;&#x4E60;&#x3002;&#x534A;&#x9014;&#x800C;&#x5E9F;&#x662F;&#x8BB8;&#x591A;&#x4EBA;&#x90FD;&#x7ECF;&#x5E38;&#x9762;&#x4E34;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5207;&#x5206;&#x51FA;&#x6765;&#x7684;&#x5C0F;&#x5757;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x67AF;&#x71E5;&#x7684;&#x57FA;&#x7840;&#x7EC3;&#x4E60;&#xFF0C;&#x80FD;&#x5728;&#x5A31;&#x4E50;&#x4E2D;&#x5B66;&#x4E60;&#x6C38;&#x8FDC;&#x53EA;&#x662F;&#x5C0F;&#x90E8;&#x5206;&#x3002;&#x6709;&#x591A;&#x67AF;&#x71E5;&#x5462;&#xFF1F;&#x6BD4;&#x5982;&#xFF0C;&#x7EC3;&#x5409;&#x4ED6;&#x7684;&#x722C;&#x683C;&#x5B50;&#xFF1B;&#x6216;&#x8005;&#x7EC3;&#x4E60;&#x6253;&#x53F0;&#x7403;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x51FA;&#x6746;&#x7684;&#x7A33;&#x5B9A;&#xFF0C;&#x7EC3;&#x4E60;&#x6345;&#x5564;&#x9152;&#x74F6;&#xFF0C;&#x8981;&#x6C42;&#x6746;&#x5B50;&#x6345;&#x8FDB;&#x53BB;&#x53C8;&#x4E0D;&#x80FD;&#x78B0;&#x5230;&#x74F6;&#x53E3;&#x3002;&#x8FD8;&#x6709;&#xFF0C;&#x5B66;&#x82F1;&#x8BED;&#x65F6;&#x4E00;&#x4E2A;&#x5143;&#x97F3;&#x4E00;&#x4E2A;&#x5143;&#x97F3;&#x5730;&#x62A0;&#x53D1;&#x97F3;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x51ED;&#x4E00;&#x8154;&#x70ED;&#x8840;&#x77ED;&#x65F6;&#x95F4;&#x53BB;&#x5C1D;&#x8BD5;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x91CF;&#x5730;&#x3001;&#x91CD;&#x590D;&#x5730;&#x6301;&#x7EED;&#x8FDB;&#x884C;&#x5F97;&#x9700;&#x8981;&#x975E;&#x5E38;&#x5F3A;&#x7684;&#x610F;&#x5FD7;&#x529B;&#x3002;&#x9996;&#x5148;&#x8FD9;&#x4E2A;&#x8BAD;&#x7EC3;&#x91CF;&#x6709;&#x591A;&#x5927;&#x5462;&#xFF1F;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x6210;&#x4E3A;&#x5927;&#x5E08;&#x5F97;&#x4E00;&#x4E07;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x5929;&#x7EC3;&#x4E60; 2 &#x5C0F;&#x65F6;&#xFF0C;&#x5F97; 13 &#x5E74;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x4E00;&#x4E07;&#x4E2A;&#x5C0F;&#x65F6;&#x53EA;&#x662F;&#x4E2A;&#x5927;&#x6982;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x6709;&#x7684;&#x9886;&#x57DF;&#x4E00;&#x4E07;&#x4E2A;&#x5C0F;&#x65F6;&#x4E5F;&#x4E0D;&#x591F;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x671F;&#x671B;&#x6210;&#x4E3A;&#x4E16;&#x754C;&#x7EA7;&#x5927;&#x5E08;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x4E13;&#x5BB6;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x76F8;&#x5F53;&#x7684;&#x7EC3;&#x4E60;&#x91CF;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x663E;&#x5F97;&#x5C24;&#x5176;&#x5173;&#x952E;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x7684;&#x4EBA;&#x80FD;&#x957F;&#x65F6;&#x95F4;&#x575A;&#x6301;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x5374;&#x5BB9;&#x6613;&#x534A;&#x9014;&#x800C;&#x5E9F;&#xFF1F;&#x53CD;&#x6620;&#x8FD9;&#x4E2A;&#x73B0;&#x8C61;&#x7684;&#x5FC3;&#x7406;&#x7279;&#x8D28;&#x79F0;&#x4E4B;&#x4E3A;&#xFF1A;&#x610F;&#x5FD7;&#x529B;&#x3002;&#x610F;&#x5FD7;&#x529B;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E09;&#x65B9;&#x9762;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF1A;&#x6211;&#x8981;&#x505A; &#x2014;&#x2014; &#x5FCD;&#x53D7;&#x4E0D;&#x9002;&#x3001;&#x538B;&#x529B;&#xFF0C;&#x575A;&#x6301;&#x6B63;&#x5728;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF1B;&#x6211;&#x4E0D;&#x8981; &#x2014;&#x2014; &#x514B;&#x5236;&#x4E00;&#x65F6;&#x7684;&#x51B2;&#x52A8;&#xFF0C;&#x62B5;&#x5236;&#x8BF1;&#x60D1;&#xFF1B;&#x6211;&#x60F3;&#x8981; &#x2014;&#x2014; &#x7262;&#x8BB0;&#x957F;&#x8FDC;&#x76EE;&#x6807;&#xFF0C;&#x4E0D;&#x4E3A;&#x77ED;&#x671F;&#x8BF1;&#x60D1;&#x6240;&#x63A7;&#x5236;&#x3002; </p>
<p>&#x5173;&#x4E8E;&#x610F;&#x5FD7;&#x529B;&#xFF0C;&#x5FC3;&#x7406;&#x5B66;&#x5BB6;&#x8FDB;&#x884C;&#x4E86;&#x5F88;&#x591A;&#x5353;&#x6709;&#x6210;&#x6548;&#x7684;&#x7814;&#x7A76;&#xFF0C;&#x76F8;&#x5173;&#x7684;&#x7814;&#x7A76;&#x6210;&#x679C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53BB;&#x9605;&#x8BFB;&#x51EF;&#x5229;&#xB7;&#x9EA6;&#x683C;&#x5C3C;&#x683C;&#x5C14;&#x7684;&#x300A;&#x81EA;&#x63A7;&#x529B;&#x300B;&#x4E00;&#x4E66;&#x3002;&#x672C;&#x6587;&#x7684;&#x6838;&#x5FC3;&#x7126;&#x70B9;&#x4E0D;&#x662F;&#x5982;&#x4F55;&#x63D0;&#x5347;&#x610F;&#x5FD7;&#x529B;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x4F5C;&#x4E3A;&#x4E2A;&#x5F00;&#x80C3;&#x751C;&#x70B9;&#xFF0C;&#x4E3A;&#x5C1A;&#x672A;&#x9605;&#x8BFB;&#x8FC7;&#x672C;&#x4E66;&#x7684;&#x8BFB;&#x8005;&#x6982;&#x62EC;&#x4E00;&#x4E0B;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x51E0;&#x4E2A;&#x6838;&#x5FC3;&#x8981;&#x70B9;&#xFF1A;</p>
<ol>
<li><p>&#x4F60;&#x7684;&#x610F;&#x5FD7;&#x529B;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x4F7F;&#x7528;&#x5C31;&#x4F1A;&#x6D88;&#x8017;&#x3002;</p>
</li>
<li><p>&#x4F60;&#x4ECE;&#x540C;&#x4E00;&#x8D26;&#x6237;&#x63D0;&#x53D6;&#x610F;&#x5FD7;&#x529B;&#x7528;&#x4E8E;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x4EFB;&#x52A1;&#x3002;&#x542F;&#x793A;&#xFF1A;&#x4E00;&#x6B21;&#x53EA;&#x505A;&#x4E00;&#x4E8B;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x6212;&#x70DF;&#x7684;&#x540C;&#x65F6;&#x53C8;&#x51CF;&#x80A5;&#xFF0C;&#x968F;&#x7740;&#x610F;&#x5FD7;&#x529B;&#x6D88;&#x8017;&#x6B86;&#x5C3D;&#xFF0C;&#x72AF;&#x9519;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4F1A;&#x6025;&#x5267;&#x589E;&#x52A0;&#x3002;</p>
</li>
<li><p>&#x4F60;&#x9700;&#x8981;&#x8461;&#x8404;&#x7CD6;&#x4E3A;&#x610F;&#x5FD7;&#x529B;&#x63D0;&#x4F9B;&#x9A71;&#x52A8;&#x529B;&#xFF1A;</p>
</li>
</ol>
<p>&#x542F;&#x793A;1&#xFF1A;&#x4E3A;&#x8EAB;&#x4F53;&#x8865;&#x8DB3;&#x80FD;&#x91CF;&#x3002;&#x591A;&#x5403;&#x4F4E;&#x8840;&#x7CD6;&#x98DF;&#x7269; &#x2014;&#x2014; &#x5927;&#x591A;&#x6570;&#x852C;&#x83DC;&#x3001;&#x575A;&#x679C;&#xFF08;&#x50CF;&#x82B1;&#x751F;&#x548C;&#x8170;&#x679C;&#xFF09;&#x3001;&#x5F88;&#x591A;&#x751F;&#x6C34;&#x679C;&#xFF08;&#x50CF;&#x82F9;&#x679C;&#x3001;&#x84DD;&#x8393;&#x548C;&#x68A8;&#x5B50;&#xFF09;&#x3001;&#x5976;&#x916A;&#x3001;&#x9C7C;&#x3001;&#x8089;&#x3001;&#x6A44;&#x6984;&#x6CB9;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x201C;&#x597D;&#x201D;&#x8102;&#x80AA;&#x3002;</p>
<p>&#x542F;&#x793A;2&#xFF1A;&#x751F;&#x75C5;&#x65F6;&#xFF0C;&#x628A;&#x8461;&#x8404;&#x7CD6;&#x7701;&#x7ED9;&#x514D;&#x75AB;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x542F;&#x793A;3&#xFF1A;&#x7D2F;&#x4E86;&#xFF0C;&#x5C31;&#x7761;&#x3002;&#x4F11;&#x606F;&#xFF0C;&#x80FD;&#x51CF;&#x5C11;&#x8EAB;&#x4F53;&#x5BF9;&#x8461;&#x8404;&#x7CD6;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x8FD8;&#x80FD;&#x5168;&#x9762;&#x589E;&#x5F3A;&#x8EAB;&#x4F53;&#x5229;&#x7528;&#x8840;&#x7CD6;&#x7684;&#x80FD;&#x529B;&#x3002;&#x6709;&#x7814;&#x7A76;&#x8BC1;&#x660E;&#xFF0C;&#x5265;&#x593A;&#x7761;&#x7720;&#x4F1A;&#x635F;&#x5BB3;&#x8461;&#x8404;&#x7CD6;&#x7684;&#x52A0;&#x5DE5;&#xFF0C;&#x8FD9;&#x4F1A;&#x7ACB;&#x5373;&#x5BFC;&#x81F4;&#x81EA;&#x5236;&#x529B;&#x4E0B;&#x964D;&#x3002;</p>
<ol>
<li><p>&#x63A7;&#x5236;&#x548C;&#x51B3;&#x7B56;&#xFF08;&#x9009;&#x62E9;&#xFF09;&#x90FD;&#x4F1A;&#x6D88;&#x8017;&#x610F;&#x5FD7;&#x529B;&#x3002;</p>
</li>
<li><p>&#x610F;&#x5FD7;&#x529B;&#x53EF;&#x4EE5;&#x57F9;&#x517B;&#x3002;&#x542F;&#x793A;&#xFF1A;&#x6CE8;&#x610F;&#x529B;&#x53EF;&#x4EE5;&#x50CF;&#x808C;&#x8089;&#x4E00;&#x6837;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x523B;&#x610F;&#x6BCF;&#x5929;&#x505A;&#x4E00;&#x4E9B;&#x4E4B;&#x524D;&#x6CA1;&#x6709;&#x517B;&#x6210;&#x4E60;&#x60EF;&#x7684;&#x5C0F;&#x4E8B;&#xFF0C;&#x6BD4;&#x5982;&#x7528;&#x4E0D;&#x5E38;&#x7528;&#x7684;&#x624B;&#x8FDB;&#x884C;&#x65E5;&#x5E38;&#x6D3B;&#x52A8;&#xFF0C;&#x6BD4;&#x5982;&#x51A5;&#x60F3; 5 &#x5206;&#x949F;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x5C0F;&#x8BAD;&#x7EC3;&#x53EF;&#x52A0;&#x5F3A;&#x4F60;&#x7684;&#x81EA;&#x63A7;&#x529B;&#x3002;</p>
</li>
<li><p>&#x96C6;&#x4E2D;&#x7CBE;&#x529B;&#x6539;&#x53D8;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x81EA;&#x5236;&#x529B;&#xFF0C;&#x5176;&#x4ED6;&#x5F88;&#x591A;&#x65B9;&#x9762;&#x90FD;&#x4F1A;&#x968F;&#x4E4B;&#x53D7;&#x76CA;&#x3002;</p>
</li>
</ol>
<p>&#x25B2;  &#x25B2;  &#x25B2;</p>
<p>&#x610F;&#x5FD7;&#x529B;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5FC3;&#x7406;&#x54C1;&#x8D28;&#xFF0C;&#x53EF;&#x8C13;&#x5BF9;&#x4EBA;&#x4EEC;&#x7684;&#x65B9;&#x65B9;&#x9762;&#x9762;&#x90FD;&#x4EA7;&#x751F;&#x5DE8;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x610F;&#x5FD7;&#x529B;&#x5F3A;&#x7684;&#x4EBA;&#xFF0C;&#x65E0;&#x8BBA;&#x5E72;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x90FD;&#x6BD4;&#x90A3;&#x4E9B;&#x610F;&#x5FD7;&#x529B;&#x8584;&#x5F31;&#x4E00;&#x70B9;&#x7684;&#x4EBA;&#x66F4;&#x80FD;&#x575A;&#x6301;&#x5462;&#xFF1F;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x90A3;&#x4E9B;&#x81EA;&#x8BA4;&#x4E3A;&#x610F;&#x5FD7;&#x529B;&#x8584;&#x5F31;&#x7684;&#x4EBA;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x5E72;&#x5565;&#x4E8B;&#x60C5;&#x90FD;&#x534A;&#x9014;&#x800C;&#x5E9F;&#x5462;&#xFF1F;&#x73B0;&#x5B9E;&#x89C2;&#x5BDF;&#x7684;&#x7ED3;&#x679C;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x662F;&#x610F;&#x5FD7;&#x529B;&#x575A;&#x5F3A;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x4F1A;&#x5728;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#x4E0A;&#x9762;&#x534A;&#x9014;&#x800C;&#x5E9F;&#x3002;&#x800C;&#x6709;&#x4E9B;&#x6211;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x603B;&#x662F;&#x53CA;&#x65F6;&#x884C;&#x4E50;&#x7684;&#x4EBA;&#xFF0C;&#x5728;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x4E0A;&#x9762;&#x5374;&#x80FD;&#x575A;&#x6301;&#x4E0D;&#x5DF2; &#x2014;&#x2014; &#x770B;&#x770B;&#x90A3;&#x4E9B;&#x75F4;&#x8FF7;&#x4E8E;&#x6253;&#x6E38;&#x620F;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E3A;&#x4E86;&#x6253;&#x6E38;&#x620F;&#x4ED8;&#x51FA;&#x591A;&#x5927;&#x7684;&#x4EE3;&#x4EF7;&#x548C;&#x52AA;&#x529B;&#xFF1A;&#x4E0D;&#x5403;&#x4E0D;&#x559D;&#xFF0C;&#x901A;&#x5BB5;&#x71AC;&#x591C;&#xFF0C;&#x4E3A;&#x4E86;&#x5347;&#x7EA7;&#x800C;&#x65E0;&#x804A;&#x5730;&#x91CD;&#x590D;&#x6253;&#x5C0F;&#x602A; &#x2014;&#x2014; &#x770B;&#x7740;&#x90FD;&#x89C9;&#x5F97;&#x65E0;&#x804A;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E8B;&#x60C5;&#x4E0D;&#x662F;&#x6E38;&#x620F;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x6240;&#x8C13;&#x7684; &#x201C;&#x6B63;&#x4E8B;&#x201D;&#xFF0C;&#x76F8;&#x4FE1;&#x4ED6;&#x4EEC;&#x7684;&#x52AA;&#x529B;&#x7A0B;&#x5EA6;&#x80FD;&#x8BA9;&#x8BB8;&#x591A;&#x4EBA;&#x611F;&#x52A8;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x5728;&#x610F;&#x5FD7;&#x529B;&#x8FD9;&#x4E2A;&#x5FC3;&#x7406;&#x54C1;&#x8D28;&#x4E0A;&#x52A0;&#x4E00;&#x4E2A;&#x60C5;&#x666F;&#x53D8;&#x91CF;&#x3002;&#x90A3;&#x4E48;&#x662F;&#x4EC0;&#x4E48;&#x56E0;&#x7D20;&#x5F71;&#x54CD;&#x4EBA;&#x4EEC;&#x4F1A;&#x5728;&#x67D0;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E0A;&#x80FD;&#x575A;&#x6301;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x5728;&#x53E6;&#x5916;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E0A;&#x5374;&#x4E0D;&#x613F;&#x610F;&#x6301;&#x7EED;&#x6295;&#x5165;&#x5462;?&#x7BA1;&#x7406;&#x5B66;&#x3001;&#x884C;&#x4E3A;&#x91D1;&#x878D;&#x5B66;&#x3001;&#x5FC3;&#x7406;&#x5B66;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6301;&#x7EED;&#x7814;&#x7A76;&#x4E86;&#x51E0;&#x5341;&#x5E74;&#xFF0C;&#x5176;&#x4E2D;&#x5F71;&#x54CD;&#x529B;&#x8F83;&#x5927;&#x7684;&#x671F;&#x671B;&#x7406;&#x8BBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x67D0;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x6FC0;&#x52B1;&#x5927;&#x5C0F;&#x53D6;&#x51B3;&#x4E8E;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x53EF;&#x80FD;&#x5E26;&#x6765;&#x4EF7;&#x503C;&#x5927;&#x5C0F;&#x53CA;&#x5B9E;&#x73B0;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x7528;&#x516C;&#x5F0F;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;&#xFF1A;</p>
<p>M&#xFF08;&#x6FC0;&#x52B1;&#x529B;&#x5EA6;&#xFF09;=&#x2211; V &#xFF08;&#x6548;&#x4EF7;&#xFF09;&#xD7; E&#xFF08;&#x671F;&#x671B;&#x6982;&#x7387;&#xFF09;</p>
<p>&#x5047;&#x5982;&#x8BF4;&#x610F;&#x5FD7;&#x529B;&#x662F;&#x8F66;&#x7684;&#x6CB9;&#x7BB1;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x90A3;&#x4E48;&#x67D0;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x6FC0;&#x52B1;&#x529B;&#x5EA6; M &#x5219;&#x8868;&#x793A;&#x51FA;&#x53D1;&#x524D;&#x7ED9;&#x8F66;&#x52A0;&#x4E86;&#x591A;&#x5C11;&#x6CB9;&#xFF0C;&#x90A3;&#x4E9B;&#x6548;&#x4EF7;&#x8D8A;&#x9AD8;&#x3001;&#x671F;&#x671B;&#x6982;&#x7387;&#x8D8A;&#x9AD8;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4EEC;&#x8D8A;&#x503E;&#x5411;&#x4E8E;&#x52A0;&#x6EE1;&#x6CB9;&#x3002;</p>

      
    </div>
    
    <div class="article-info article-info-index">
      
      
    <div class="article-category tagcloud">
    <a class="article-category-link" href="/categories/励志/">励志</a>
    </div>


      
    <div class="article-tag tagcloud">
        <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/坚持/">坚持</a></li></ul>
    </div>

      
      <div class="clearfix"></div>
    </div>
    
  </div>
  
</article>









  
    <article id="post-hls-6" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/10/23/hls-6/" class="article-date">
      <time datetime="2016-10-23T00:07:38.000Z" itemprop="datePublished">2016-10-23</time>
</a>

 
    <a href="/2016/10/23/hls-6/#comments" title="查看评论">
        <i class="fa fa-comments-o" aria-hidden="true"></i>
        <span class="count-comment"></span>
        
            <span class="ds-thread-count"  data-thread-key="2016/10/23/hls-6/" ></span>
        
        
            <span class="disqus-comment-count" data-disqus-identifier="2016/10/23/hls-6/"></span>
        
    </a>

    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/23/hls-6/">软件工程ER图</a>
    </h1>
  

      </header>
      
    
    <div class="article-entry" itemprop="articleBody">
      
          
        <p>&#x6B63;&#x5F0F;&#x7248;&#x7F8E;&#x5316;&#x7248;<br><img src="/2016/10/23/hls-6/r2.jpg" alt="hls"><br>&#x624B;&#x5DE5;&#x5DE8;&#x4E11;&#x7248;<br><img src="/2016/10/23/hls-6/r1.jpg" alt="hls"></p>

      
    </div>
    
    <div class="article-info article-info-index">
      
      
    <div class="article-category tagcloud">
    <a class="article-category-link" href="/categories/软件设计/">软件设计</a>
    </div>


      
    <div class="article-tag tagcloud">
        <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/图文/">图文</a></li></ul>
    </div>

      
      <div class="clearfix"></div>
    </div>
    
  </div>
  
</article>









  
    <article id="post-hls-5" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/10/23/hls-5/" class="article-date">
      <time datetime="2016-10-23T00:05:49.000Z" itemprop="datePublished">2016-10-23</time>
</a>

 
    <a href="/2016/10/23/hls-5/#comments" title="查看评论">
        <i class="fa fa-comments-o" aria-hidden="true"></i>
        <span class="count-comment"></span>
        
            <span class="ds-thread-count"  data-thread-key="2016/10/23/hls-5/" ></span>
        
        
            <span class="disqus-comment-count" data-disqus-identifier="2016/10/23/hls-5/"></span>
        
    </a>

    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/23/hls-5/">抽象类和接口联系与区别</a>
    </h1>
  

      </header>
      
    
    <div class="article-entry" itemprop="articleBody">
      
          
        <p>&#x62BD;&#x8C61;&#x7C7B;&#x548C;&#x63A5;&#x53E3;&#x8054;&#x7CFB;&#x4E0E;&#x533A;&#x522B;<br>&#x5173;&#x952E;&#x5B57;: &#x62BD;&#x8C61;&#x7C7B;&#x4E0E;&#x63A5;&#x53E3;&#x7684;&#x533A;&#x522B;<br>abstract class&#x548C;interface&#x662F;Java&#x8BED;&#x8A00;&#x4E2D;&#x5BF9;&#x4E8E;&#x62BD;&#x8C61;&#x7C7B;&#x5B9A;&#x4E49;&#x8FDB;&#x884C;&#x652F;&#x6301;&#x7684;&#x4E24;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x6B63;&#x662F;&#x7531;&#x4E8E;&#x8FD9;&#x4E24;&#x79CD;&#x673A;&#x5236;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x624D;&#x8D4B;&#x4E88;&#x4E86;Java&#x5F3A;&#x5927;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x80FD;&#x529B;&#x3002; abstract class&#x548C;interface&#x4E4B;&#x95F4;&#x5728;&#x5BF9;&#x4E8E;&#x62BD;&#x8C61;&#x7C7B;&#x5B9A;&#x4E49;&#x7684;&#x652F;&#x6301;&#x65B9;&#x9762;&#x5177;&#x6709;&#x5F88;&#x5927;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x66FF;&#x6362;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x5728;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#x7C7B;&#x5B9A;&#x4E49;&#x65F6;&#x5BF9;&#x4E8E; abstract class&#x548C;interface&#x7684;&#x9009;&#x62E9;&#x663E;&#x5F97;&#x6BD4;&#x8F83;&#x968F;&#x610F;&#x3002;<br>&#x5176;&#x5B9E;&#xFF0C;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x5927;&#x7684;&#x533A;&#x522B;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x9009;&#x62E9;&#x751A;&#x81F3;&#x53CD;&#x6620;&#x51FA;&#x5BF9;&#x4E8E;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x672C;&#x8D28;&#x7684;&#x7406;&#x89E3;&#x3001;&#x5BF9;&#x4E8E;&#x8BBE;&#x8BA1;&#x610F;&#x56FE;&#x7684;&#x7406;&#x89E3;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3001;&#x5408;&#x7406;&#x3002;&#x672C;&#x6587;&#x5C06;&#x5BF9;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x8FDB;&#x884C;&#x4E00;&#x756A;&#x5256;&#x6790;&#xFF0C;&#x8BD5;&#x56FE;&#x7ED9;&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5728;&#x4E8C;&#x8005;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#x7684;&#x4F9D;&#x636E;&#x3002;<br>&#x4E00;&#x3001;&#x7406;&#x89E3;&#x62BD;&#x8C61;&#x7C7B;<br>abstract class&#x548C;interface&#x5728;Java&#x8BED;&#x8A00;&#x4E2D;&#x90FD;&#x662F;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#x7C7B;&#xFF08;&#x672C;&#x6587;&#x4E2D;&#x7684;&#x62BD;&#x8C61;&#x7C7B;&#x5E76;&#x975E;&#x4ECE;abstract class&#x7FFB;&#x8BD1;&#x800C;&#x6765;&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x4F53;&#xFF0C;&#x800C;abstract class&#x4E3A;Java&#x8BED;&#x8A00;&#x4E2D;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x62BD;&#x8C61;&#x7C7B;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x8BF7;&#x8BFB;&#x8005;&#x6CE8;&#x610F;&#x533A;&#x5206;&#xFF09;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x4EC0;&#x4E48;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x7C7B;&#x80FD;&#x4E3A;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#x5462;&#xFF1F;<br>&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x6982;&#x5FF5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x7C7B;&#x6765;&#x63CF;&#x7ED8;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x53CD;&#x8FC7;&#x6765;&#x5374;&#x4E0D;&#x662F; &#x8FD9;&#x6837;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x7C7B;&#x90FD;&#x662F;&#x7528;&#x6765;&#x63CF;&#x7ED8;&#x5BF9;&#x8C61;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x63CF;&#x7ED8;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7C7B;&#x5C31;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#x3002;&#x62BD;&#x8C61;&#x7C7B;&#x5F80;&#x5F80;&#x7528;&#x6765;&#x8868;&#x5F81;&#x6211;&#x4EEC;&#x5728;&#x5BF9;&#x95EE;&#x9898;&#x9886; &#x57DF;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x3001;&#x8BBE;&#x8BA1;&#x4E2D;&#x5F97;&#x51FA;&#x7684;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#xFF0C;&#x662F;&#x5BF9;&#x4E00;&#x7CFB;&#x5217;&#x770B;&#x4E0A;&#x53BB;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x672C;&#x8D28;&#x4E0A;&#x76F8;&#x540C;&#x7684;&#x5177;&#x4F53;&#x6982;&#x5FF5;&#x7684;&#x62BD;&#x8C61;&#x3002;<br>&#x6BD4;&#x5982;&#xFF1A;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x56FE;&#x5F62;&#x7F16;&#x8F91;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x5B58;&#x5728;&#x7740;&#x5706;&#x3001;&#x4E09;&#x89D2;&#x5F62; &#x8FD9;&#x6837;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x6982;&#x5FF5;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x53C8;&#x90FD;&#x5C5E;&#x4E8E;&#x5F62;&#x72B6;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x5F62;&#x72B6;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5728;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#x3002;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x62BD;&#x8C61;&#x7684;&#x6982;&#x5FF5;&#x5728;&#x95EE;&#x9898; &#x9886;&#x57DF;&#x6CA1;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x5177;&#x4F53;&#x6982;&#x5FF5;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x4EE5;&#x8868;&#x5F81;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#x7684;&#x62BD;&#x8C61;&#x7C7B;&#x662F;&#x4E0D;&#x80FD;&#x591F;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x3002;<br>&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x9886;&#x57DF;&#xFF0C;&#x62BD;&#x8C61;&#x7C7B;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x9690;&#x85CF;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6784;&#x9020;&#x51FA;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x4E00;&#x7EC4;&#x884C; &#x4E3A;&#x7684;&#x62BD;&#x8C61;&#x63CF;&#x8FF0;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x7EC4;&#x884C;&#x4E3A;&#x5374;&#x80FD;&#x591F;&#x6709;&#x4EFB;&#x610F;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x4E2A;&#x62BD;&#x8C61;&#x63CF;&#x8FF0;&#x5C31;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x7EC4;&#x4EFB;&#x610F;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x5219;&#x8868;&#x73B0;&#x4E3A;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x6D3E;&#x751F;&#x7C7B;&#x3002;&#x6A21;&#x5757;&#x53EF; &#x4EE5;&#x64CD;&#x4F5C;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x4F53;&#x3002;&#x7531;&#x4E8E;&#x6A21;&#x5757;&#x4F9D;&#x8D56;&#x4E8E;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x62BD;&#x8C61;&#x4F53;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x4E0D;&#x5141;&#x8BB8;&#x4FEE;&#x6539;&#x7684;&#xFF1B;&#x540C;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x4ECE;&#x8FD9;&#x4E2A;&#x62BD;&#x8C61;&#x4F53;&#x6D3E;&#x751F;&#xFF0C;&#x4E5F;&#x53EF;&#x6269;&#x5C55;&#x6B64;&#x6A21;&#x5757;&#x7684;&#x884C;&#x4E3A;&#x529F;&#x80FD;&#x3002;&#x719F;&#x6089;OCP&#x7684;&#x8BFB; &#x8005;&#x4E00;&#x5B9A;&#x77E5;&#x9053;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x4E2A;&#x6700;&#x6838;&#x5FC3;&#x7684;&#x539F;&#x5219;OCP(Open-Closed Principle)&#xFF0C;&#x62BD;&#x8C61;&#x7C7B;&#x662F;&#x5176;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x6240;&#x5728;&#x3002;<br>&#x4E8C;&#x3001;&#x4ECE;&#x8BED;&#x6CD5;&#x5B9A;&#x4E49;&#x5C42;&#x9762;&#x770B;abstract class&#x548C;interface<br>&#x5728;&#x8BED;&#x6CD5;&#x5C42;&#x9762;&#xFF0C;Java&#x8BED;&#x8A00;&#x5BF9;&#x4E8E;abstract class&#x548C;interface&#x7ED9;&#x51FA;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x5B9A;&#x4E49;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0B;&#x9762;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;Demo&#x7684;&#x62BD;&#x8C61;&#x7C7B;&#x4E3A;&#x4F8B;&#x6765;&#x8BF4;&#x660E;&#x8FD9;&#x79CD;&#x4E0D;&#x540C;&#x3002;&#x4F7F;&#x7528;abstract class&#x7684;&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;Demo&#x62BD;&#x8C61;&#x7C7B;&#x7684;&#x65B9;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;<br>java &#x4EE3;&#x7801;<br>abstract class Demo &#xFF5B;<br>abstract void method1();<br>abstract void method2();<br>&#x2026;<br>&#xFF5D;<br>&#x4F7F;&#x7528;interface&#x7684;&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;Demo&#x62BD;&#x8C61;&#x7C7B;&#x7684;&#x65B9;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;<br>java &#x4EE3;&#x7801;<br>interface Demo {<br>void method1();<br>void method2();<br>&#x2026;<br>}<br>&#x5728;abstract class&#x65B9;&#x5F0F;&#x4E2D;&#xFF0C;Demo&#x53EF;&#x4EE5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x6210;&#x5458;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6709;&#x975E;abstarct&#x7684;&#x6210;&#x5458;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x5728;interface&#x65B9;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;Demo&#x53EA;&#x80FD;&#x591F;&#x6709;&#x9759;&#x6001;&#x7684; &#x4E0D;&#x80FD;&#x88AB;&#x4FEE;&#x6539;&#x7684;&#x6570;&#x636E;&#x6210;&#x5458;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5FC5;&#x987B;&#x662F;static final&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;interface&#x4E2D;&#x4E00;&#x822C;&#x4E0D;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x6210;&#x5458;&#xFF09;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6210;&#x5458;&#x65B9;&#x6CD5;&#x90FD;&#x662F;abstract&#x7684;&#x3002;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x8BF4;&#xFF0C;interface&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A; &#x5F62;&#x5F0F;&#x7684;abstract class&#x3002;<br>&#x4ECE;&#x7F16;&#x7A0B;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;abstract class&#x548C;interface&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x201D;design by contract&#x201D;&#x7684;&#x601D;&#x60F3;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5177;&#x4F53;&#x7684;&#x4F7F;&#x7528;&#x4E0A;&#x9762;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x533A;&#x522B;&#x7684;&#x3002;<br>&#x9996;&#x5148;&#xFF0C;abstract class&#x5728;Java&#x8BED;&#x8A00;&#x4E2D;&#x8868;&#x793A;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x4E00;&#x6B21;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x5374;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;interface&#x3002;&#x4E5F;&#x8BB8;&#xFF0C;&#x8FD9;&#x662F;Java&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x5728;&#x8003;&#x8651;Java&#x5BF9;&#x4E8E;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x7684;&#x652F;&#x6301;&#x65B9;&#x9762;&#x7684;&#x4E00;&#x79CD;&#x6298;&#x4E2D;&#x8003;&#x8651;&#x5427;&#x3002;<br>&#x5176;&#x6B21;&#xFF0C;&#x5728;abstract class&#x7684;&#x5B9A;&#x4E49;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8D4B;&#x4E88;&#x65B9;&#x6CD5;&#x7684;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x3002;&#x4F46;&#x662F;&#x5728;interface&#x7684;&#x5B9A;&#x4E49;&#x4E2D;&#xFF0C;&#x65B9;&#x6CD5;&#x5374;&#x4E0D;&#x80FD;&#x62E5;&#x6709;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#xFF0C;&#x4E3A;&#x4E86;&#x7ED5;&#x8FC7;&#x8FD9;&#x4E2A;&#x9650;&#x5236;&#xFF0C;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x59D4;&#x6258;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4F1A; &#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x6709;&#x65F6;&#x4F1A;&#x9020;&#x6210;&#x5F88;&#x5927;&#x7684;&#x9EBB;&#x70E6;&#x3002;<br>&#x5728;&#x62BD;&#x8C61;&#x7C7B;&#x4E2D;&#x4E0D;&#x80FD;&#x5B9A;&#x4E49;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x8FD8;&#x5B58;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x7EF4;&#x62A4;&#x4E0A;&#x7684; &#x9EBB;&#x70E6;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x540E;&#x6765;&#x60F3;&#x4FEE;&#x6539;&#x7C7B;&#x7684;&#x754C;&#x9762;&#xFF08;&#x4E00;&#x822C;&#x901A;&#x8FC7;abstract class&#x6216;&#x8005;interface&#x6765;&#x8868;&#x793A;&#xFF09;&#x4EE5;&#x9002;&#x5E94;&#x65B0;&#x7684;&#x60C5;&#x51B5;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x7ED9;&#x5DF2;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x53C2;&#x6570;&#xFF09;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x9EBB;&#x70E6;&#xFF0C;&#x53EF;&#x80FD;&#x8981;&#x82B1;&#x8D39;&#x5F88;&#x591A;&#x7684;&#x65F6; &#x95F4;&#xFF08;&#x5BF9;&#x4E8E;&#x6D3E;&#x751F;&#x7C7B;&#x5F88;&#x591A;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5C24;&#x4E3A;&#x5982;&#x6B64;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x754C;&#x9762;&#x662F;&#x901A;&#x8FC7;abstract class&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x5C31;&#x53EA;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5B9A;&#x4E49;&#x5728;abstract class&#x4E2D;&#x7684;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;<br>&#x540C;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x5728;&#x62BD;&#x8C61;&#x7C7B;&#x4E2D;&#x5B9A;&#x4E49;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#xFF0C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x540C;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x51FA;&#x73B0;&#x5728;&#x8BE5;&#x62BD;&#x8C61;&#x7C7B; &#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6D3E;&#x751F;&#x7C7B;&#x4E2D;&#xFF0C;&#x8FDD;&#x53CD;&#x4E86;&#x201D;one rule&#xFF0C;one place&#x201D;&#x539F;&#x5219;&#xFF0C;&#x9020;&#x6210;&#x4EE3;&#x7801;&#x91CD;&#x590D;&#xFF0C;&#x540C;&#x6837;&#x4E0D;&#x5229;&#x4E8E;&#x4EE5;&#x540E;&#x7684;&#x7EF4;&#x62A4;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;abstract class&#x548C;interface&#x95F4;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#x65F6;&#x8981;&#x975E;&#x5E38;&#x7684;&#x5C0F;&#x5FC3;&#x3002;<br>&#x4E09;&#x3001;&#x4ECE;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x5C42;&#x9762;&#x770B;abstract class&#x548C;interface<br>&#x4E0A;&#x9762;&#x4E3B;&#x8981;&#x4ECE;&#x8BED;&#x6CD5;&#x5B9A;&#x4E49;&#x548C;&#x7F16;&#x7A0B;&#x7684;&#x89D2;&#x5EA6;&#x8BBA;&#x8FF0;&#x4E86;abstract class&#x548C;interface&#x7684;&#x533A;&#x522B;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C42;&#x9762;&#x7684;&#x533A;&#x522B;&#x662F;&#x6BD4;&#x8F83;&#x4F4E;&#x5C42;&#x6B21;&#x7684;&#x3001;&#x975E;&#x672C;&#x8D28;&#x7684;&#x3002;&#x672C;&#x6587;&#x5C06;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x5C42;&#x9762;&#xFF1A;abstract class&#x548C;interface&#x6240;&#x53CD;&#x6620;&#x51FA;&#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#xFF0C;&#x6765;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x4E8C;&#x8005;&#x7684;&#x533A;&#x522B;&#x3002;&#x4F5C;&#x8005;&#x8BA4;&#x4E3A;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x624D;&#x80FD;&#x7406;&#x89E3;&#x4E8C;&#x8005;&#x6982;&#x5FF5;&#x7684;&#x672C;&#x8D28;&#x6240;&#x5728;&#x3002;<br>&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;abstarct class&#x5728;Java&#x8BED;&#x8A00;&#x4E2D;&#x4F53;&#x73B0;&#x4E86;&#x4E00;&#x79CD;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#xFF0C;&#x8981;&#x60F3;&#x4F7F;&#x5F97;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x5408;&#x7406;&#xFF0C;&#x7236;&#x7C7B;&#x548C;&#x6D3E;&#x751F;&#x7C7B;&#x4E4B;&#x95F4;&#x5FC5;&#x987B;&#x5B58;&#x5728;&#x201D;is a&#x201D;&#x5173;&#x7CFB;&#xFF0C;&#x5373;&#x7236;&#x7C7B;&#x548C;&#x6D3E;&#x751F;&#x7C7B;&#x5728;&#x6982;&#x5FF5;&#x672C;&#x8D28;&#x4E0A;&#x5E94;&#x8BE5;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x5BF9;&#x4E8E;interface &#x6765;&#x8BF4;&#x5219;&#x4E0D;&#x7136;&#xFF0C;&#x5E76;&#x4E0D;&#x8981;&#x6C42;interface&#x7684;&#x5B9E;&#x73B0;&#x8005;&#x548C;interface&#x5B9A;&#x4E49;&#x5728;&#x6982;&#x5FF5;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5B9E;&#x73B0;&#x4E86;interface&#x5B9A;&#x4E49;&#x7684;&#x5951;&#x7EA6;&#x800C;&#x5DF2;&#x3002;&#x4E3A;&#x4E86;&#x4F7F; &#x8BBA;&#x8FF0;&#x4FBF;&#x4E8E;&#x7406;&#x89E3;&#xFF0C;&#x4E0B;&#x9762;&#x5C06;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x4F8B;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#x3002;<br>&#x8003;&#x8651;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;Door&#x7684;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#xFF0C;&#x8BE5;Door&#x5177;&#x6709;&#x6267;&#x884C;&#x4E24;&#x4E2A;&#x52A8;&#x4F5C;open&#x548C;close&#xFF0C;&#x6B64;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;abstract class&#x6216;&#x8005;interface&#x6765;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x8868;&#x793A;&#x8BE5;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5B9A;&#x4E49;&#x65B9;&#x5F0F;&#x5206;&#x522B;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;<br>&#x4F7F;&#x7528;abstract class&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;Door&#xFF1A;<br>java &#x4EE3;&#x7801;<br>abstract class Door {<br>abstract void open();<br>abstract void close()&#xFF1B;<br>}<br>&#x4F7F;&#x7528;interface&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;Door&#xFF1A;<br>java &#x4EE3;&#x7801;<br>interface Door {<br>void open();<br>void close();<br>}<br>&#x5176;&#x4ED6;&#x5177;&#x4F53;&#x7684;Door&#x7C7B;&#x578B;&#x53EF;&#x4EE5;extends&#x4F7F;&#x7528;abstract class&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#x7684;Door&#x6216;&#x8005;implements&#x4F7F;&#x7528;interface&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#x7684;Door&#x3002;&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x4F7F;&#x7528;abstract class&#x548C;interface&#x6CA1;&#x6709;&#x5927;&#x7684;&#x533A;&#x522B;&#x3002;<br>&#x5982;&#x679C;&#x73B0;&#x5728;&#x8981;&#x6C42;Door&#x8FD8;&#x8981;&#x5177;&#x6709;&#x62A5;&#x8B66;&#x7684;&#x529F;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x8BE5;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x9488;&#x5BF9;&#x8BE5;&#x4F8B;&#x5B50;&#x7684;&#x7C7B;&#x7ED3;&#x6784;&#x5462;&#xFF08;&#x5728; &#x672C;&#x4F8B;&#x4E2D;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x5C55;&#x793A;abstract class&#x548C;interface&#x53CD;&#x6620;&#x5728;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x4E0A;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x65E0;&#x5173;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x505A;&#x4E86;&#x7B80;&#x5316;&#x6216;&#x8005;&#x5FFD;&#x7565;&#xFF09;&#x4E0B;&#x9762;&#x5C06;&#x7F57;&#x5217;&#x51FA;&#x53EF;&#x80FD;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x4ECE;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x5C42;&#x9762;&#x5BF9;&#x8FD9;&#x4E9B;&#x4E0D; &#x540C;&#x7684;&#x65B9;&#x6848;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x3002;<br>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E00;&#xFF1A;<br>&#x7B80;&#x5355;&#x7684;&#x5728;Door&#x7684;&#x5B9A;&#x4E49;&#x4E2D;&#x589E;&#x52A0;&#x4E00;&#x4E2A;alarm&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;<br>java &#x4EE3;&#x7801;<br>&#x6216;&#x8005;<br>java &#x4EE3;&#x7801;<br>interface Door {<br>void open();<br>void close();<br>void alarm();<br>}<br>&#x90A3;&#x4E48;&#x5177;&#x6709;&#x62A5;&#x8B66;&#x529F;&#x80FD;&#x7684;AlarmDoor&#x7684;&#x5B9A;&#x4E49;&#x65B9;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;<br>java &#x4EE3;&#x7801;<br>class AlarmDoor extends Door {<br>void open() { &#x2026; }<br>void close() { &#x2026; }<br>void alarm() { &#x2026; }<br>}<br>&#x6216;&#x8005;<br>java &#x4EE3;&#x7801;<br>class AlarmDoor implements Door &#xFF5B;<br>void open() { &#x2026; }<br>void close() { &#x2026; }<br>void alarm() { &#x2026; }<br>&#xFF5D;<br>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x8FDD;&#x53CD;&#x4E86;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x539F;&#x5219;ISP&#xFF08;Interface Segregation Priciple&#xFF09;&#xFF0C;&#x5728;Door&#x7684;&#x5B9A;&#x4E49;&#x4E2D;&#x628A;Door&#x6982;&#x5FF5;&#x672C;&#x8EAB;&#x56FA;&#x6709;&#x7684;&#x884C;&#x4E3A;&#x65B9;&#x6CD5;&#x548C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x201D;&#x62A5;&#x8B66;&#x5668;&#x201D;&#x7684;&#x884C;&#x4E3A;&#x65B9;&#x6CD5;&#x6DF7;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#x3002;&#x8FD9;&#x6837;&#x5F15;&#x8D77;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x90A3;&#x4E9B;&#x4EC5;&#x4EC5; &#x4F9D;&#x8D56;&#x4E8E;Door&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x6A21;&#x5757;&#x4F1A;&#x56E0;&#x4E3A;&#x201D;&#x62A5;&#x8B66;&#x5668;&#x201D;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x6539;&#x53D8;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;&#x4FEE;&#x6539;alarm&#x65B9;&#x6CD5;&#x7684;&#x53C2;&#x6570;&#xFF09;&#x800C;&#x6539;&#x53D8;&#xFF0C;&#x53CD;&#x4E4B;&#x4F9D;&#x7136;&#x3002;<br>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E8C;&#xFF1A;<br>&#x65E2;&#x7136;open&#x3001;close&#x548C;alarm&#x5C5E;&#x4E8E;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6839;&#x636E;ISP&#x539F;&#x5219;&#x5E94;&#x8BE5;&#x628A;&#x5B83; &#x4EEC;&#x5206;&#x522B;&#x5B9A;&#x4E49;&#x5728;&#x4EE3;&#x8868;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x62BD;&#x8C61;&#x7C7B;&#x4E2D;&#x3002;&#x5B9A;&#x4E49;&#x65B9;&#x5F0F;&#x6709;&#xFF1A;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x90FD;&#x4F7F;&#x7528;abstract class&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#xFF1B;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x90FD;&#x4F7F;&#x7528;interface&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#xFF1B;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x4F7F;&#x7528;abstract class&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x4F7F;&#x7528;interface&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#x3002;<br>&#x663E;&#x7136;&#xFF0C;&#x7531;&#x4E8E;Java&#x8BED;&#x8A00;&#x4E0D;&#x652F;&#x6301;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#xFF0C;&#x6240;&#x4EE5;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x90FD;&#x4F7F;&#x7528;abstract class&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#x662F;&#x4E0D;&#x53EF;&#x884C;&#x7684;&#x3002;&#x540E;&#x9762;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x90FD;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x9009;&#x62E9;&#x5374;&#x53CD;&#x6620;&#x51FA;&#x5BF9;&#x4E8E;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x6982;&#x5FF5;&#x672C;&#x8D28;&#x7684;&#x7406;&#x89E3;&#x3001;&#x5BF9;&#x4E8E;&#x8BBE;&#x8BA1;&#x610F;&#x56FE;&#x7684;&#x53CD;&#x6620;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3001;&#x5408;&#x7406;&#x3002;&#x6211;&#x4EEC;&#x4E00;&#x4E00;&#x6765;&#x5206;&#x6790;&#x3001;&#x8BF4;&#x660E;&#x3002;<br>&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x90FD;&#x4F7F;&#x7528;interface&#x65B9;&#x5F0F;&#x6765;&#x5B9A;&#x4E49;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53CD;&#x6620;&#x51FA;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;<br>1&#x3001;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x7406;&#x89E3;&#x6E05;&#x695A;&#x95EE;&#x9898;&#x9886;&#x57DF;&#xFF0C;AlarmDoor&#x5728;&#x6982;&#x5FF5;&#x672C;&#x8D28;&#x4E0A;&#x5230;&#x5E95;&#x662F;Door&#x8FD8;&#x662F;&#x62A5;&#x8B66;&#x5668;&#xFF1F;<br>2&#x3001;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x7684;&#x7406;&#x89E3;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5BF9;&#x4E8E;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x7684;&#x5206;&#x6790;&#x53D1;&#x73B0; AlarmDoor&#x5728;&#x6982;&#x5FF5;&#x672C;&#x8D28;&#x4E0A;&#x548C;Door&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5728;&#x5B9E;&#x73B0;&#x65F6;&#x5C31;&#x6CA1;&#x6709;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x7684;&#x63ED;&#x793A;&#x6211;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x610F;&#x56FE;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x5B9A;&#x4E49;&#x4E0A;&#xFF08;&#x5747;&#x4F7F;&#x7528; interface&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#xFF09;&#x53CD;&#x6620;&#x4E0D;&#x51FA;&#x4E0A;&#x8FF0;&#x542B;&#x4E49;&#x3002;<br>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x7684;&#x7406;&#x89E3;&#x662F;&#xFF1A;AlarmDoor&#x5728;&#x6982;&#x5FF5;&#x672C;&#x8D28;&#x4E0A;&#x662F;Door&#xFF0C;&#x540C; &#x65F6;&#x5B83;&#x6709;&#x5177;&#x6709;&#x62A5;&#x8B66;&#x7684;&#x529F;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x8BE5;&#x5982;&#x4F55;&#x6765;&#x8BBE;&#x8BA1;&#x3001;&#x5B9E;&#x73B0;&#x6765;&#x660E;&#x786E;&#x7684;&#x53CD;&#x6620;&#x51FA;&#x6211;&#x4EEC;&#x7684;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x8BF4;&#x8FC7;&#xFF0C;abstract class&#x5728;Java&#x8BED;&#x8A00;&#x4E2D;&#x8868;&#x793A;&#x4E00;&#x79CD;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x5728;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x201D;is a&#x201D;&#x5173;&#x7CFB;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;Door&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;abstarct class&#x65B9;&#x5F0F;&#x6765;&#x5B9A;&#x4E49;&#x3002;&#x53E6;&#x5916;&#xFF0C;AlarmDoor&#x53C8;&#x5177;&#x6709;&#x62A5;&#x8B66;&#x529F;&#x80FD;&#xFF0C;&#x8BF4;&#x660E;&#x5B83;&#x53C8;&#x80FD;&#x591F;&#x5B8C;&#x6210;&#x62A5;&#x8B66;&#x6982;&#x5FF5;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x6240;&#x4EE5;&#x62A5;&#x8B66;&#x6982;&#x5FF5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;interface&#x65B9;&#x5F0F;&#x5B9A; &#x4E49;&#x3002;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;<br>java &#x4EE3;&#x7801;<br>abstract class Door {<br>abstract void open();<br>abstract void close()&#xFF1B;<br>}<br>java &#x4EE3;&#x7801;<br>interface Alarm {<br>void alarm();<br>}<br>java &#x4EE3;&#x7801;<br>class AlarmDoor extends Door implements Alarm {<br>void open() { &#x2026; }<br>void close() { &#x2026; }<br>void alarm() { &#x2026; }<br>}<br>&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x57FA;&#x672C;&#x4E0A;&#x80FD;&#x591F;&#x660E;&#x786E;&#x7684;&#x53CD;&#x6620;&#x51FA;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6B63;&#x786E;&#x7684;&#x63ED;&#x793A;&#x6211;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1; &#x610F;&#x56FE;&#x3002;&#x5176;&#x5B9E;abstract class&#x8868;&#x793A;&#x7684;&#x662F;&#x201D;is a&#x201D;&#x5173;&#x7CFB;&#xFF0C;interface&#x8868;&#x793A;&#x7684;&#x662F;&#x201D;like a&#x201D;&#x5173;&#x7CFB;&#xFF0C;&#x5927;&#x5BB6;&#x5728;&#x9009;&#x62E9;&#x65F6;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F9D;&#x636E;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x5BF9;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x7684;&#x7406;&#x89E3;&#x4E0A;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;AlarmDoor&#x5728;&#x6982;&#x5FF5;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x62A5;&#x8B66;&#x5668;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x5177;&#x6709; Door&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x4E0A;&#x8FF0;&#x7684;&#x5B9A;&#x4E49;&#x65B9;&#x5F0F;&#x5C31;&#x8981;&#x53CD;&#x8FC7;&#x6765;&#x4E86;&#x3002;<br>abstract class&#x548C;interface&#x662F;Java&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x4E24;&#x79CD;&#x5B9A;&#x4E49;&#x62BD;&#x8C61;&#x7C7B;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6709;&#x5F88;&#x5927;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x9009;&#x62E9;&#x5374;&#x53C8;&#x5F80;&#x5F80;&#x53CD;&#x6620;&#x51FA;&#x5BF9;&#x4E8E;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x6982; &#x5FF5;&#x672C;&#x8D28;&#x7684;&#x7406;&#x89E3;&#x3001;&#x5BF9;&#x4E8E;&#x8BBE;&#x8BA1;&#x610F;&#x56FE;&#x7684;&#x53CD;&#x6620;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3001;&#x5408;&#x7406;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x8868;&#x73B0;&#x4E86;&#x6982;&#x5FF5;&#x95F4;&#x7684;&#x4E0D;&#x540C;&#x7684;&#x5173;&#x7CFB;&#xFF08;&#x867D;&#x7136;&#x90FD;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x9700;&#x6C42;&#x7684;&#x529F;&#x80FD;&#xFF09;&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x8BED;&#x8A00;&#x7684;&#x4E00;&#x79CD;&#x7684;&#x60EF;&#x7528;&#x6CD5;&#x3002;<br> &#x603B;&#x7ED3;&#x51E0;&#x53E5;&#x8BDD;&#x6765;&#x8BF4;&#xFF1A;<br>1&#x3001;&#x62BD;&#x8C61;&#x7C7B;&#x548C;&#x63A5;&#x53E3;&#x90FD;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x62BD;&#x8C61;&#x7C7B;&#x53D8;&#x91CF;&#x5FC5;&#x987B;&#x6307;&#x5411;&#x5B9E;&#x73B0;&#x6240;&#x6709;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x7684;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#xFF0C;&#x63A5;&#x53E3;&#x53D8;&#x91CF;&#x5FC5;&#x987B;&#x6307;&#x5411;&#x5B9E;&#x73B0;&#x6240;&#x6709;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#x7684;&#x7C7B;&#x5BF9;&#x8C61;&#x3002;<br>2&#x3001;&#x62BD;&#x8C61;&#x7C7B;&#x8981;&#x88AB;&#x5B50;&#x7C7B;&#x7EE7;&#x627F;&#xFF0C;&#x63A5;&#x53E3;&#x8981;&#x88AB;&#x7C7B;&#x5B9E;&#x73B0;&#x3002;<br>3&#x3001;&#x63A5;&#x53E3;&#x53EA;&#x80FD;&#x505A;&#x65B9;&#x6CD5;&#x7533;&#x660E;&#xFF0C;&#x62BD;&#x8C61;&#x7C7B;&#x4E2D;&#x53EF;&#x4EE5;&#x505A;&#x65B9;&#x6CD5;&#x7533;&#x660E;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;<br>4&#x3001;&#x63A5;&#x53E3;&#x91CC;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x53EA;&#x80FD;&#x662F;&#x516C;&#x5171;&#x7684;&#x9759;&#x6001;&#x7684;&#x5E38;&#x91CF;&#xFF0C;&#x62BD;&#x8C61;&#x7C7B;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x662F;&#x666E;&#x901A;&#x53D8;&#x91CF;&#x3002;<br>5&#x3001;&#x62BD;&#x8C61;&#x7C7B;&#x91CC;&#x7684;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x5FC5;&#x987B;&#x5168;&#x90E8;&#x88AB;&#x5B50;&#x7C7B;&#x6240;&#x5B9E;&#x73B0;&#xFF0C;&#x5982;&#x679C;&#x5B50;&#x7C7B;&#x4E0D;&#x80FD;&#x5168;&#x90E8;&#x5B9E;&#x73B0;&#x7236;&#x7C7B;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x5B50;&#x7C7B;&#x53EA;&#x80FD;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x4E0D;&#x80FD;&#x5168;&#x90E8;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x7C7B;&#x4E5F;&#x53EA;&#x80FD;&#x4E3A;&#x62BD;&#x8C61;&#x7C7B;&#x3002;<br>6&#x3001;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x53EA;&#x80FD;&#x7533;&#x660E;&#xFF0C;&#x4E0D;&#x80FD;&#x5B9E;&#x73B0;&#x3002;abstract void abc();&#x4E0D;&#x80FD;&#x5199;&#x6210;abstract void abc(){}&#x3002;<br>7&#x3001;&#x62BD;&#x8C61;&#x7C7B;&#x91CC;&#x53EF;&#x4EE5;&#x6CA1;&#x6709;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;<br>8&#x3001;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x91CC;&#x6709;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7C7B;&#x53EA;&#x80FD;&#x662F;&#x62BD;&#x8C61;&#x7C7B;<br>9&#x3001;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x8981;&#x88AB;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x662F;&#x79C1;&#x6709;&#x7684;&#x3002;<br>10&#x3001;&#x63A5;&#x53E3;&#x53EF;&#x7EE7;&#x627F;&#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x53EF;&#x591A;&#x7EE7;&#x627F;&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x7C7B;&#x53EA;&#x80FD;&#x5355;&#x6839;&#x7EE7;&#x627F;&#x3002;<br>&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x516C;&#x7528;&#x7684;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#xFF0C;&#x62BD;&#x8C61;&#x7C7B;&#x6709;&#x5B83;&#x7684;&#x4F18;&#x70B9;&#x3002;&#x62BD;&#x8C61;&#x7C7B;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x5B9E;&#x73B0;&#x7684;&#x5C42;&#x6B21;&#x5173;&#x7CFB;&#xFF0C;&#x907F;&#x514D;&#x4EE3;&#x7801;&#x91CD;&#x590D;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x4F7F;&#x7528;&#x62BD; &#x8C61;&#x7C7B;&#x7684;&#x573A;&#x5408;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x5FFD;&#x89C6;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x6A21;&#x578B;&#x7684;&#x539F;&#x5219;&#x3002;&#x4ECE;&#x5B9E;&#x8DF5;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;&#x7C7B;&#x6765;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#xFF0C;&#x5F80;&#x5F80;&#x5BFC;&#x81F4;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x80FD; &#x591F;&#x66F4;&#x6709;&#x6548;&#x5730;&#x5206;&#x79BB;&#x884C;&#x4E3A;&#x4E0E;&#x5B9E;&#x73B0;&#xFF0C;&#x4E3A;&#x4EE3;&#x7801;&#x7684;&#x7EF4;&#x62A4;&#x548C;&#x4FEE;&#x6539;&#x5E26;&#x6765;&#x65B9;&#x4FBF;&#x3002;</p>

      
    </div>
    
    <div class="article-info article-info-index">
      
      
    <div class="article-category tagcloud">
    <a class="article-category-link" href="/categories/软件设计/">软件设计</a>
    </div>


      
    <div class="article-tag tagcloud">
        <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/program/">program</a></li></ul>
    </div>

      
      <div class="clearfix"></div>
    </div>
    
  </div>
  
</article>









  
    <article id="post-hls-4" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/10/23/hls-4/" class="article-date">
      <time datetime="2016-10-22T23:59:43.000Z" itemprop="datePublished">2016-10-23</time>
</a>

 
    <a href="/2016/10/23/hls-4/#comments" title="查看评论">
        <i class="fa fa-comments-o" aria-hidden="true"></i>
        <span class="count-comment"></span>
        
            <span class="ds-thread-count"  data-thread-key="2016/10/23/hls-4/" ></span>
        
        
            <span class="disqus-comment-count" data-disqus-identifier="2016/10/23/hls-4/"></span>
        
    </a>

    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/23/hls-4/">软件设计模式通俗理解</a>
    </h1>
  

      </header>
      
    
    <div class="article-entry" itemprop="articleBody">
      
          
        <p>&#x6BD4;&#x5982;&#x4F60;&#x53BB;&#x4E70;&#x7535;&#x8111;&#x4E86;&#xFF0C;&#x80AF;&#x5B9A;&#x5230;&#x7535;&#x8111;&#x5546;&#x5BB6;&#x90A3;&#x53BB;&#x4E70;&#xFF0C;&#x7535;&#x8111;&#x5546;&#x5BB6;&#x5C31;&#x662F;&#x4E2A;&#x4EE3;&#x7406;&#xFF08;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#xFF09;&#x3002;&#x800C;&#x4EE3;&#x7406;&#x5728;&#x8FDB;&#x8D27;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x4ECE;&#x5404;&#x4E2A;&#x5382;&#x5BB6;&#x53BB;&#x63D0;&#x8D27;&#xFF0C;&#x5382;&#x5BB6;&#x5C31;&#x662F;&#x5DE5;&#x5382;&#xFF08;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF09;&#x3002;&#x4E70;&#x5B8C;&#x914D;&#x4EF6;&#x4E86;&#xFF0C;&#x5546;&#x5BB6;&#x4E00;&#x822C;&#x90FD;&#x7ED9;&#x4F60;&#x7EC4;&#x88C5;&#xFF0C;&#x88C5;&#x5B8C;&#x4E86;&#x518D;&#x7ED9;&#x4F60;&#x3002;&#x4F60;&#x5C31;&#x80FD;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x4F7F;&#x7528;&#xFF08;&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#xFF09;&#x3002;&#x73B0;&#x5728;&#x5978;&#x5546;&#x592A;&#x591A;&#xFF0C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4F60;&#x90FD;&#x5F97;&#x6CE8;&#x610F;&#x5427;&#x3002;&#x4E00;&#x6709;&#x4E0D;&#x5BF9;&#x5C31;&#x8981;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#x3002;&#x3002;&#x3002;&#xFF08;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF09;&#x8FD8;&#x6709;&#xFF0C;&#x5728;&#x663E;&#x5361;&#x6362;&#x4EE3;&#x65F6;&#xFF0C;&#x66FE;&#x4ECA;&#x51FA;&#x8FC7;&#x4E00;&#x79CD;&#x4E3B;&#x677F;&#xFF0C;&#x80FD;&#x5728;&#x65B0;&#x4E3B;&#x677F;&#x4E0A;&#x63D2;agp&#x663E;&#x5361;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#xFF08;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#xFF09;&#x3002;&#x3002;&#x3002;&#x3002;</p>

      
    </div>
    
    <div class="article-info article-info-index">
      
      
    <div class="article-category tagcloud">
    <a class="article-category-link" href="/categories/软件设计模式/">软件设计模式</a>
    </div>


      
    <div class="article-tag tagcloud">
        <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/program/">program</a></li></ul>
    </div>

      
      <div class="clearfix"></div>
    </div>
    
  </div>
  
</article>









  
    <article id="post-hls-3" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/10/22/hls-3/" class="article-date">
      <time datetime="2016-10-22T06:15:20.000Z" itemprop="datePublished">2016-10-22</time>
</a>

 
    <a href="/2016/10/22/hls-3/#comments" title="查看评论">
        <i class="fa fa-comments-o" aria-hidden="true"></i>
        <span class="count-comment"></span>
        
            <span class="ds-thread-count"  data-thread-key="2016/10/22/hls-3/" ></span>
        
        
            <span class="disqus-comment-count" data-disqus-identifier="2016/10/22/hls-3/"></span>
        
    </a>

    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/22/hls-3/">Ionic安装</a>
    </h1>
  

      </header>
      
    
    <div class="article-entry" itemprop="articleBody">
      
          
        <p><img src="https://pic.36krcnd.com/avatar/201610/21162753/jfaop1pmsw4d6wk5.jpg!heading"></p>
<p>1.<br>&#x5B89;&#x88C5;node.js&#xFF08;&#x7565;&#xFF09;</p>
<p>2.<br>npm install -g cnpm &#x2013;registry=<a href="https://registry.npm.taobao.org/" target="_blank" rel="external">https://registry.npm.taobao.org/</a></p>
<p>3.&#x8FD9;&#x4E2A;&#x8DEF;&#x5F84;&#x4E0B;C:\Program Files\nodejs\node_modules\npm\npmrc<br>registry=<a href="https://registry.cnpmjs.org" target="_blank" rel="external">https://registry.cnpmjs.org</a></p>
<p>4.&#x521D;&#x59CB;&#x5316;&#x9879;&#x76EE;<br>ionic start demo &#x2013;v2</p>
<p><img src="http://chuantu.biz/t5/39/1477116762x2875796722.png"></p>

      
    </div>
    
    <div class="article-info article-info-index">
      
      

      
      
      <div class="clearfix"></div>
    </div>
    
  </div>
  
</article>









  
    <article id="post-hls-2" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/10/22/hls-2/" class="article-date">
      <time datetime="2016-10-22T06:10:59.000Z" itemprop="datePublished">2016-10-22</time>
</a>

 
    <a href="/2016/10/22/hls-2/#comments" title="查看评论">
        <i class="fa fa-comments-o" aria-hidden="true"></i>
        <span class="count-comment"></span>
        
            <span class="ds-thread-count"  data-thread-key="2016/10/22/hls-2/" ></span>
        
        
            <span class="disqus-comment-count" data-disqus-identifier="2016/10/22/hls-2/"></span>
        
    </a>

    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/22/hls-2/">MyEclipse导入jquery-1.8.0.min.js等文件报错的解决方案</a>
    </h1>
  

      </header>
      
    
    <div class="article-entry" itemprop="articleBody">
      
          
        <p>MyEclipse&#x5BFC;&#x5165;jquery-1.8.0.min.js&#x7B49;&#x6587;&#x4EF6;&#x62A5;&#x9519;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</p>
<p>&#x7248;&#x6743;&#x58F0;&#x660E;&#xFF1A;&#x672C;&#x6587;&#x4E3A;&#x535A;&#x4E3B;&#x539F;&#x521B;&#x6587;&#x7AE0;&#xFF0C;&#x672A;&#x7ECF;&#x535A;&#x4E3B;&#x5141;&#x8BB8;&#x4E0D;&#x5F97;&#x8F6C;&#x8F7D;&#x3002;</p>
<p>MyEclipse&#x5BFC;&#x5165;jQuery-1.8.0.min.js&#x7B49;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x62A5;&#x4E86;&#x4E00;&#x5806;missing semicolon&#x7684;&#x9519;&#x8BEF;&#x3002;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x62A5;&#x9519;&#x5462;&#xFF1F;&#x65B9;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1&#x3001;&#x9009;&#x4E2D;&#x62A5;&#x9519;&#x7684;jquery&#x6587;&#x4EF6;&#x4F8B;&#x5982;&#x201C;jquery-1.8.0.min.js&#x201D;&#x3002;</p>
<p>2&#x3001;&#x53F3;&#x952E;&#x9009;&#x62E9; MyEclipse&#x2013;&gt;Exclude From Validation &#x3002;</p>
<p>3&#x3001;&#x518D;&#x53F3;&#x952E;&#x9009;&#x62E9; MyEclipse&#x2013;&gt;Run Validation &#x5373;&#x53EF;&#x3002; </p>

      
    </div>
    
    <div class="article-info article-info-index">
      
      
    <div class="article-category tagcloud">
    <a class="article-category-link" href="/categories/程序/">程序</a>
    </div>


      
    <div class="article-tag tagcloud">
        <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/MyEclipse/">MyEclipse</a></li></ul>
    </div>

      
      <div class="clearfix"></div>
    </div>
    
  </div>
  
</article>









  
    <article id="[layout]-postName" class="article article-type-[layout]" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/10/22/postName/" class="article-date">
      <time datetime="2016-10-22T02:40:31.000Z" itemprop="datePublished">2016-10-22</time>
</a>

 
    <a href="/2016/10/22/postName/#comments" title="查看评论">
        <i class="fa fa-comments-o" aria-hidden="true"></i>
        <span class="count-comment"></span>
        
            <span class="ds-thread-count"  data-thread-key="2016/10/22/postName/" ></span>
        
        
            <span class="disqus-comment-count" data-disqus-identifier="2016/10/22/postName/"></span>
        
    </a>

    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/22/postName/">这个站点是这样做的</a>
    </h1>
  

      </header>
      
    
    <div class="article-entry" itemprop="articleBody">
      
          
        <p>Hexo&#x5E38;&#x7528;&#x7684;&#x51E0;&#x4E2A;&#x547D;&#x4EE4;<br>&#x521B;&#x5EFA;&#x65B0;&#x535A;&#x6587;</p>
<p>&#x6267;&#x884C;new&#x547D;&#x4EE4;&#xFF0C;&#x751F;&#x6210;&#x6307;&#x5B9A;&#x540D;&#x79F0;&#x7684;&#x6587;&#x7AE0;&#x81F3;hexo\source_posts\postName.md&#x3002;</p>
<p>1<br>hexo new [layout] &#x201C;postName&#x201D; #&#x65B0;&#x5EFA;&#x6587;&#x7AE0;<br>&#x5176;&#x4E2D;layout&#x662F;&#x53EF;&#x9009;&#x53C2;&#x6570;&#xFF0C;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A;post&#x3002;&#x6709;&#x54EA;&#x4E9B;layout&#x5462;&#xFF0C;&#x8BF7;&#x5230;scaffolds&#x76EE;&#x5F55;&#x4E0B;&#x67E5;&#x770B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#x5C31;&#x662F;layout&#x540D;&#x79F0;&#x3002;&#x5F53;&#x7136;&#x4F60;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x81EA;&#x5DF1;&#x7684;layout&#xFF0C;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5373;&#x53EF;&#xFF0C;&#x540C;&#x65F6;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7F16;&#x8F91;&#x73B0;&#x6709;&#x7684;layout&#xFF0C;&#x6BD4;&#x5982;post&#x7684;layout&#x9ED8;&#x8BA4;&#x662F;hexo\scaffolds\post.md</p>

      
    </div>
    
    <div class="article-info article-info-index">
      
      

      
    <div class="article-tag tagcloud">
        <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/java/">java</a></li></ul>
    </div>

      
      <div class="clearfix"></div>
    </div>
    
  </div>
  
</article>









  
    <article id="post-hello-world" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/10/22/hello-world/" class="article-date">
      <time datetime="2016-10-22T01:37:57.850Z" itemprop="datePublished">2016-10-22</time>
</a>

 
    <a href="/2016/10/22/hello-world/#comments" title="查看评论">
        <i class="fa fa-comments-o" aria-hidden="true"></i>
        <span class="count-comment"></span>
        
            <span class="ds-thread-count"  data-thread-key="2016/10/22/hello-world/" ></span>
        
        
            <span class="disqus-comment-count" data-disqus-identifier="2016/10/22/hello-world/"></span>
        
    </a>

    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/10/22/hello-world/">hls-初始化</a>
    </h1>
  

      </header>
      
    
    <div class="article-entry" itemprop="articleBody">
      
          
        <p>Welcome to <a href="https://hexo.io/" target="_blank" rel="external">Hexo</a>! This is my very first post. Check <a href="https://hexo.io/docs/" target="_blank" rel="external">documentation</a> for more info. If i get any problems when using Hexo, you i find the answer in <a href="https://hexo.io/docs/troubleshooting.html" target="_blank" rel="external">troubleshooting</a> or i can ask me on <a href="https://github.com/hexojs/hexo/issues" target="_blank" rel="external">GitHub</a>.</p>
<h2 id="Quick-Start"><a href="#Quick-Start" class="headerlink" title="Quick Start"></a>Quick Start</h2><h3 id="Create-a-new-post"><a href="#Create-a-new-post" class="headerlink" title="Create a new post"></a>Create a new post</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">$ hexo new <span class="string">&quot;My New Post&quot;</span></div></pre></td></tr></table></figure>
<p>More info: <a href="https://hexo.io/docs/writing.html" target="_blank" rel="external">Writing</a></p>
<h3 id="Run-server"><a href="#Run-server" class="headerlink" title="Run server"></a>Run server</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">$ hexo server</div></pre></td></tr></table></figure>
<p>More info: <a href="https://hexo.io/docs/server.html" target="_blank" rel="external">Server</a></p>
<h3 id="Generate-static-files"><a href="#Generate-static-files" class="headerlink" title="Generate static files"></a>Generate static files</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">$ hexo generate</div></pre></td></tr></table></figure>
<p>More info: <a href="https://hexo.io/docs/generating.html" target="_blank" rel="external">Generating</a></p>
<h3 id="Deploy-to-remote-sites"><a href="#Deploy-to-remote-sites" class="headerlink" title="Deploy to remote sites"></a>Deploy to remote sites</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">$ hexo deploy</div></pre></td></tr></table></figure>
<p>More info: <a href="https://hexo.io/docs/deployment.html" target="_blank" rel="external">Deployment</a></p>

      
    </div>
    
    <div class="article-info article-info-index">
      
      

      
      
      <div class="clearfix"></div>
    </div>
    
  </div>
  
</article>









  
  
</div>
      <footer id="footer">
    <div class="outer">
        <div id="footer-info">
            <div class="footer-left">
                <i class="fa fa-copyright"></i> 
                2016 黄柳淞
            </div>
            <div class="footer-right">
                <a href="http://hexo.io/" target="_blank" title="快速、简洁且高效的博客框架">Hexo</a>  Theme <a href="https://github.com/MOxFIVE/hexo-theme-yelee" target="_blank" title="简而不减 Hexo 双栏博客主题  v3.5">Yelee</a> by MOxFIVE <i class="fa fa-heart animated infinite pulse"></i>
            </div>
        </div>
        
            <div class="visit">
                
                    <span id="busuanzi_container_site_pv" style='display:none'>
                        <span id="site-visit" title="本站到访数"><i class="fa fa-user" aria-hidden="true"></i><span id="busuanzi_value_site_uv"></span>
                        </span>
                    </span>
                
                
                    <span>| </span>
                
                
                    <span id="busuanzi_container_page_pv" style='display:none'>
                        <span id="page-visit"  title="本页阅读量"><i class="fa fa-eye animated infinite pulse" aria-hidden="true"></i><span id="busuanzi_value_page_pv"></span>
                        </span>
                    </span>
                
            </div>
        
    </div>
</footer>
    </div>
    
<script data-main="/js/main.js" src="//cdn.bootcss.com/require.js/2.2.0/require.min.js"></script>

    <script>
        $(document).ready(function() {
            var iPad = window.navigator.userAgent.indexOf('iPad');
            if (iPad > -1 || $(".left-col").css("display") === "none") {
                var bgColorList = ["#9db3f4", "#414141", "#e5a859", "#f5dfc6", "#c084a0", "#847e72", "#cd8390", "#996731"];
                var bgColor = Math.ceil(Math.random() * (bgColorList.length - 1));
                $("body").css({"background-color": bgColorList[bgColor], "background-size": "cover"});
            }
            else {
                var backgroundnum = 5;
                var backgroundimg = "url(/background/bg-x.jpg)".replace(/x/gi, Math.ceil(Math.random() * backgroundnum));
                $("body").css({"background": backgroundimg, "background-attachment": "fixed", "background-size": "cover"});
            }
        })
    </script>


    
        <script>
            if ($(".left-col").is(":visible")) {
                var duoshuoQuery = {short_name:"null"};
                (function() {
                    var d = document, s = d.createElement('script');
                    s.src = 'http://static.duoshuo.com/embed.js';
                    s.async = true; s.charset = 'UTF-8';
                    (d.head || d.body).appendChild(s);
                })();

                $(document).ready(function(){
                    var $duoshuoCount = $(".ds-thread-count");
                    $duoshuoCount.bind("DOMNodeInserted", function(e) {
                        var num = $(this).text().replace(/[^0-9]/ig,"");
                        $(this).siblings(".count-comment").text(num);
                        $(this).remove();
                    })
                })
            }
        </script>
    

    
        <script id="dsq-count-scr" src="//null.disqus.com/count.js" async></script>
        <script>
            if ($(".left-col").is(":visible")) {
                var $disqusCount = $(".disqus-comment-count");
                $disqusCount.bind("DOMNodeInserted", function(e) {
                    var num = $(this).text().replace(/[^0-9]/ig,"");
                    if (num > 0) {
                        $(this).siblings(".count-comment").text(num);
                    }
                    $(this).remove();
                })
            } else {
                $(".disqus-comment-count").remove();
            }
        </script>
     




<div class="scroll" id="scroll">
    <a href="#" title="返回顶部"><i class="fa fa-arrow-up"></i></a>
    <a href="#comments" onclick="load$hide();" title="查看评论"><i class="fa fa-comments-o"></i></a>
    <a href="#footer" title="转到底部"><i class="fa fa-arrow-down"></i></a>
</div>
<script>
    // Open in New Window
    
        var oOpenInNew = {
            
             title: "a.article-title, .article-more-link a", 
             post: ".article-entry a[href], .copyright a[href]", 
             tags: ".article-tag a", 
             categories: ".article-category a, a.tag-list-link", 
             articleNav: "#article-nav a, #post-nav-button a", 
             archives: ".archive-article-title", 
             miniArchives: "a.post-list-link", 
             menu: ".header-menu a", 
             friends: "#js-friends a", 
             socail: ".social a" 
        }
        for (var x in oOpenInNew) {
            $(oOpenInNew[x]).attr("target", "_blank");
        }
    
</script>

<script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js">
</script>
  </div>
</body>
</html>